&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	СтрокаСписокНоменклатуры = Элементы.СписокНоменклатуры.ТекущиеДанные;
    РаботаСДокументами.РасчетСуммы(СтрокаСписокНоменклатуры);
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	СтрокаСписокНоменклатуры = Элементы.СписокНоменклатуры.ТекущиеДанные;
    РаботаСДокументами.РасчетСуммы(СтрокаСписокНоменклатуры);
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	СтрокаСписокНоменклатуры = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РасчетЦены(СтрокаСписокНоменклатуры);
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма");

КонецПроцедуры
