
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЦеныНоменклатуры
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаСписокНоменклатуры Из СписокНоменклатуры Цикл
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокНоменклатуры.Номенклатура;
		Движение.Цена = ТекСтрокаСписокНоменклатуры.Цена;
		
		НоменклатураОбъект = ТекСтрокаСписокНоменклатуры.Номенклатура.ПолучитьОбъект();
		НоменклатураОбъект.Цена = ТекСтрокаСписокНоменклатуры.Цена;
		НоменклатураОбъект.Записать();
		
	КонецЦикла;

КонецПроцедуры
